[
  {
    "recipeId": "1",
    "recipeName": "Cabbage Fat-Burning Soup",
    "recipeSource": "The book of recipes",
    "preparationTime": "12:45",
    "instructions": "Place carrots, onions, tomatoes, cabbage, green beans, peppers, and celery in a large pot. Add onion soup mix, tomato juice, beef broth, and enough water to cover vegetables. Simmer until vegetables are tender. May be stored in the refrigerator for several days."
  },
  {
    "recipeId": "2",
    "recipeName": "Chicken Breasts Pierre",
    "recipeSource": "Nancy",
    "preparationTime": "01:30",
    "instructions": "In a shallow dish or bowl, combine flour, 1/2 teaspoon salt and ground black pepper. Coat chicken breasts with flour mixture. Melt butter in a large skillet over medium heat, and brown chicken on all sides. Remove from skillet, and drain on paper towels"
  },
  {
    "recipeId": "3",
    "recipeName": "Devil's Meatloaf on the Grill",
    "recipeSource": "Heatheross",
    "preparationTime": "00:30",
    "instructions": "Mix ground beef, chorizo sausage, egg, bread crumbs, green chilies, onion, barbecue sauce, ketchup, and onion soup mix in a large bowl until well-combined. Cover and refrigerate overnight"
  },
  {
    "recipeId": "4",
    "recipeName": "The Best Rolled Sugar Cookies",
    "recipeSource": "Jill Saunders",
    "preparationTime": "00:45",
    "instructions": "In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight)"
  },
  {
    "recipeId": "5",
    "recipeName": "Northern Italian Beef Stew",
    "recipeSource": "Karen Barris Calabro",
    "preparationTime": "02:10",
    "instructions": "Heat olive oil in a large skillet over medium-high heat. Cook beef in batches in hot oil until browned completely, about 5 minutes per batch. Remove browned beef cubes to a plate lined with paper towels, keeping skillet over heat and retaining the beef drippings Cook and stironion, celery, and carrots in the retained beef drippings until just softened, 2 to 3 minutes. Stir mushrooms and garlic into the onion mixture. Pour red wine into the pan; bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Continue cooking the mixture until the wine evaporates, 7 to 10 minutes. Stir tomatoes into the mixture."
  },
  {
    "recipeId": "6",
    "recipeName": "Chef John's Baba Ghanoush",
    "recipeSource": "Chef John",
    "preparationTime": "01:05",
    "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Prick the surface of the skin of eggplants several times with the tip of a knife. Place eggplants directly on grill. Turn frequently with tongs while skin chars. Cook until eggplants have collapsed and are very soft, 25 to 30 minutes. Transfer to a bowl and cover tightly with aluminum foil and allow to cool, about 15 minutes."
  },
  {
    "recipeId": "7",
    "recipeName": "Amazing No Cook Spinach Artichoke Dip",
    "recipeSource": "bronxdog",
    "preparationTime": "00:10",
    "instructions": "Blend onion and garlic in a food processor until finely chopped. Add artichoke hearts; process until chopped. Add spinach, Parmesan cheese, and vegetable soup mix; process until well incorporated. Transfer mixture to a nonmetallic bowl."
  }
]